In [141]:
import numpy as np
import pandas as pd

In [142]:
df = pd.DataFrame(columns=["Id","Name","Age","Job","City"])
df

Empty DataFrame
Columns: [Id, Name, Age, Job, City]
Index: []

In [143]:

def insert_data(id,name,age,job,city):
    df.Id=[id]
    df.Name=[name]
    df.Age=[age]
    df.Job=[job]
    df.City=[city]

In [173]:
insert_data(1,"ahmed",21,"engineer","cairo")

In [145]:
df

   Id   Name  Age       Job   City
0   1  ahmed   21  engineer  cairo

In [146]:
def update_data(id,to_change,value):
    df[to_change][id-1]=value

In [147]:
df

   Id   Name  Age       Job   City
0   1  ahmed   21  engineer  cairo

In [148]:
update_data(1,"Name","Ali") #ignore warnings

<ipython-input-146-48b368aa6379>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[to_change][id-1]=value

In [149]:
df

   Id Name  Age       Job   City
0   1  Ali   21  engineer  cairo

In [152]:
# Aggregation

df["Aggregated"] = df["Job"] + " " + df["Name"]

In [153]:
df

   Id Name  Age       Job   City    Aggregated
0   1  Ali   21  engineer  cairo  engineer Ali

In [164]:
def delete_data(id):
    '''
     PASS THE ID NUMBER TO DELETE THE CORRESPONDING RECORD
    '''
    df.drop(index=id-1,axis=0 ,inplace=True)

In [162]:
delete_data(1)

In [163]:
df

Empty DataFrame
Columns: [Id, Name, Age, Job, City, Aggregated]
Index: []

## To Save To a Text File

In [177]:
df.to_csv("database",index=False,header=True)